<a href="https://colab.research.google.com/github/apogace/Data-612-HW-1/blob/main/Anastas_Pogace_Data_612_HW1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment for Week 1

## Purpose:      
This assignment is intended to help you do the following:       
1.	Open a GitHub account for your own use and for your career advancement (if you already do not have one).     
2.	Submit information and code in GitHub following best practices from the Udacity course.     
3.	Explore a dataset thoroughly.      
4.	Find and print descriptive information from the dataset.

## Action Items:           
Open a GitHub account to submit your work. If you are new to GitHub, follow the videos and instructions on the following link to understand how to post things on GitHub and start your own account. https://blog.udacity.com/2015/06/a-beginners-git-github-tutorial.html and/or https://guides.github.com/activities/hello-world/     

1.   Select the dataset of your choice from the list 
provided <a href="https://github.com/frankData612/data_612">here.</a>   
2.   Load the dataset using Jupyter notebook and explore the data by using the following.


-	Show the .head() and .tail() of the data set. Specify the number of rows to print using .head() and .tail().      
-	Print the column names.      
-	Print to see what is the type of your data set    
-	Check number of rows and columns.
-	Use groupby() and find the mean on your selected colum/s.
-	Add a README file in GitHub where you explain everything you did.

***Anastas Pogace ***

>

In [8]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/frankData612/data_612/master/baseballdatabank-master/core/Salaries.csv')

1. Show the .head() and .tail() of the data set. Specify the number of rows to print using .head() and .tail().

In [10]:
df.head(5)

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [11]:
df.tail(5)

       yearID teamID lgID   playerID    salary
26423    2016    WAS   NL  strasst01  10400000
26424    2016    WAS   NL  taylomi02    524000
26425    2016    WAS   NL  treinbl01    524900
26426    2016    WAS   NL  werthja01  21733615
26427    2016    WAS   NL  zimmery01  14000000

2. Print the column names.

In [12]:
df.columns

Index(['yearID', 'teamID', 'lgID', 'playerID', 'salary'], dtype='object')

3. Print to see what is the type of your data set

In [14]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.dtypes

yearID       int64
teamID      object
lgID        object
playerID    object
salary       int64
dtype: object

4. Check number of rows and columns.

In [17]:
df.shape

(26428, 5)

5. Use groupby() and find the mean on your selected colum/s.

In [19]:
df.groupby('yearID')['salary'].mean()

yearID
1985    4.762994e+05
1986    4.171470e+05
1987    4.347295e+05
1988    4.531711e+05
1989    5.063231e+05
1990    5.119737e+05
1991    8.949612e+05
1992    1.047521e+06
1993    9.769666e+05
1994    1.049589e+06
1995    9.649791e+05
1996    1.027909e+06
1997    1.218687e+06
1998    1.280845e+06
1999    1.485317e+06
2000    1.992985e+06
2001    2.279841e+06
2002    2.392527e+06
2003    2.573473e+06
2004    2.491776e+06
2005    2.633831e+06
2006    2.834521e+06
2007    2.941436e+06
2008    3.136517e+06
2009    3.277647e+06
2010    3.278747e+06
2011    3.318838e+06
2012    3.458421e+06
2013    3.723344e+06
2014    3.980446e+06
2015    4.301276e+06
2016    4.396410e+06
Name: salary, dtype: float64

In [20]:
df.groupby('teamID')['salary'].mean()

teamID
ANA    1.895109e+06
ARI    2.521796e+06
ATL    2.211176e+06
BAL    2.028839e+06
BOS    2.968591e+06
CAL    7.390732e+05
CHA    2.168060e+06
CHN    2.353348e+06
CIN    1.759987e+06
CLE    1.651203e+06
COL    2.133870e+06
DET    2.386561e+06
FLO    1.147986e+06
HOU    1.788017e+06
KCA    1.528023e+06
LAA    4.291454e+06
LAN    2.795034e+06
MIA    2.606827e+06
MIL    2.263543e+06
MIN    1.733695e+06
ML4    6.132436e+05
MON    7.074589e+05
NYA    3.968910e+06
NYN    2.463020e+06
OAK    1.440271e+06
PHI    2.271127e+06
PIT    1.268396e+06
SDN    1.523845e+06
SEA    2.155174e+06
SFN    2.418565e+06
SLN    2.161110e+06
TBA    1.656852e+06
TEX    2.177103e+06
TOR    2.013889e+06
WAS    2.935073e+06
Name: salary, dtype: float64